docs/1c-export-2026-06-02/InformationRegisters/ViberИсторииСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ViberИсторииСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочтено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Напрвление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Viber_Направление</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧатID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТокенСообщния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПривличения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Непрочитаное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Видео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/ТипФайлаОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипФайлаОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/КонтактыViber.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонтактыViber</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДиалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривличения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОбласти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/МодульУправленияViber/Ext/Module.bsl
#Область Проциддуры_Функции_Входящего_Запроса_SEND

Функция ОбработатьВходящийЗапрос(Запрос, НастройкиВайбер) Экспорт
	
	ДанныеЗапроса = ДанныеЗапроса(Запрос);
	
	Если ДанныеЗапроса.event = "conversation_started" Тогда
		
		Идентификатор = Строка(СокрЛП(ДанныеЗапроса.user.id));
		Если Не КлиентСуществует(Идентификатор) Тогда
			Возврат БизнесЛогикаViber.ЗафиксироватьНовогоОтправителяИОтправитьТекстПриведствия(ДанныеЗапроса.user, НастройкиВайбер);
		Иначе
			Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
		КонецЕсли;	
	ИначеЕсли ДанныеЗапроса.event = "subscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусРазрешенияДиалога(ДанныеЗапроса, НастройкиВайбер);
	ИначеЕсли ДанныеЗапроса.event = "unsubscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусОтпискиОтБота(ДанныеЗапроса, НастройкиВайбер); 
	ИначеЕсли ДанныеЗапроса.event = "message" Тогда
		Возврат БизнесЛогикаViber.ОбработатьСообщение(ДанныеЗапроса, НастройкиВайбер);
	ИначеЕсли ДанныеЗапроса.event = "seen" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусПрочитано(ДанныеЗапроса, НастройкиВайбер);	
	ИначеЕсли ДанныеЗапроса.event = "delivered" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусДоставлено(ДанныеЗапроса, НастройкиВайбер);	
	КонецЕсли;
	
	
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция ДанныеЗапроса(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Возврат ОбщегоНазначенияHTTPViber.ОбъектJSON(ТелоЗапроса);	
	
КонецФункции

#КонецОбласти  

#Область Проциддуры_Функции_Входящего_Запроса_SENDSECOND

Функция ОбработатьВходящийЗапросSECOND(Запрос) Экспорт
	
	ДанныеЗапроса = ДанныеЗапроса(Запрос);
	
	Если ДанныеЗапроса.event = "conversation_started" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьНовогоОтправителяИОтправитьТекстПриведствия(ДанныеЗапроса.user);
	ИначеЕсли ДанныеЗапроса.event = "subscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусРазрешенияДиалога(ДанныеЗапроса);
	ИначеЕсли ДанныеЗапроса.event = "unsubscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусОтпискиОтБота(ДанныеЗапроса); 
	ИначеЕсли ДанныеЗапроса.event = "message" Тогда
		Возврат БизнесЛогикаViber.ОбработатьСообщение(ДанныеЗапроса);		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция ДанныеЗапросаSECOND(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Возврат ОбщегоНазначенияHTTPViber.ОбъектJSON(ТелоЗапроса);	
	
КонецФункции

#КонецОбласти
 

#Область Общие_Команды_И_Процедуры_Viber

Функция ОтправитьНаРегистрациюWebhook(Настройки)Экспорт 
	
	ИмяМетода = "set_webhook";
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("url", Настройки.URL);
	СтруктураЗапроса.Вставить("send_name", Строка("true"));
	СтруктураЗапроса.Вставить("send_photo", Строка("true"));
	
	Ответ = ОтправитьЗапросViber(Настройки, ИмяМетода, СтруктураЗапроса);
	
	Возврат Ответ;	
		
КонецФункции   

Функция УдалитьСРегистрацииWebhook(Настройки)Экспорт 
	
	ИмяМетода = "set_webhook";
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("url", Настройки.URL);
		
	Ответ = ОтправитьЗапросViber(Настройки, ИмяМетода, СтруктураЗапроса);
	
	Возврат Ответ;	
		
КонецФункции

Функция ОтправитьСообщениеПользователю(Настройка, Клиент, Текст)Экспорт
	
	ИмяМетода = "send_message";
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("receiver", СокрЛП(Клиент.Идентификатор));
	СтруктураЗапроса.Вставить("sender", Новый Структура("name", Настройка.ИмяОтправителя));
	СтруктураЗапроса.Вставить("type", "text");
    СтруктураЗапроса.Вставить("text", Текст); 
	
	Ответ = ОтправитьЗапросViber(Настройка, ИмяМетода, СтруктураЗапроса); 
	
	Возврат Ответ;
	  
 	
КонецФункции	

Функция ОтправитьСообщениеФайлПользователю(Настройка, Клиент, ДанныеФайла)Экспорт
	
	ИмяМетода = "send_message";
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("receiver", СокрЛП(Клиент.Идентификатор));
	СтруктураЗапроса.Вставить("sender", Новый Структура("name", Настройка.ИмяОтправителя));
	Если ДанныеФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Изображение Тогда 
		СтруктураЗапроса.Вставить("type", "picture");
	ИначеЕсли ДанныеФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Видео Тогда
		СтруктураЗапроса.Вставить("type", "video");
		СтруктураЗапроса.Вставить("size", ДанныеФайла.Размер);
		//СтруктураЗапроса.Вставить("file_name", ДанныеФайла.Имя); 

	Иначе
		СтруктураЗапроса.Вставить("type", "file");
		СтруктураЗапроса.Вставить("size", ДанныеФайла.Размер);
		СтруктураЗапроса.Вставить("file_name", ДанныеФайла.Имя); 

	КонецЕсли;	
		
		
    СтруктураЗапроса.Вставить("media", ДанныеФайла.Путь); 

	СтруктураЗапроса.Вставить("tracking_data", "tracking data"); 
	СтруктураЗапроса.Вставить("min_api_version", "1");
	
	Ответ = ОтправитьЗапросViber(Настройка, ИмяМетода, СтруктураЗапроса); 
	
	Возврат Ответ;  
	
КонецФункции	

#КонецОбласти

#Область ОбщийЗапросВайбер

Функция ОтправитьЗапросViber(Настройки, ИмяМетода, СтруктураЗапроса)Экспорт
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	СтрокаJSON = КодироватьСтроку(СтрокаJSON, СпособКодированияСтроки.КодировкаURL);
	
	ХТТПСоединение = Новый HTTPСоединение(СокрЛП(Настройки.UrlViber)+ИмяМетода,,,,,,SSL);
		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса); 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Viber-Auth-Token", СокрЛП(Настройки.Token));
	ХТТПЗапрос = Новый HTTPЗапрос("",Заголовки);
	ХТТПЗапрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
	ХТТПЗапрос.Заголовки = Заголовки;
	
	Ответ = ХТТПСоединение.ОтправитьДляОбработки(ХТТПЗапрос);
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния=200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТекстОтвета);
		ДеревоОтвета =  ПрочитатьJSON(Чтение,Ложь);
		Возврат ДеревоОтвета;
	Иначе
		Сообщить("Ошибка: "+Ответ.КодСостояния); 
	КонецЕсли; 


	
КонецФункции

#КонецОбласти

#Область Бизнес_Логика_1С

Процедура ЗарегистрироватьСообщениеПользователяИсходящее(Ответ, СтруктураФайла = Неопределено, Контакт, Настройка, Текст, Пользователь)Экспорт
	
	Если СтруктураФайла <> Неопределено Тогда
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		Запись.Дата                = ТекущаяДатаСеанса();
		Запись.Контакт             = Контакт;
		Запись.Напрвление          = Перечисления.Viber_Направление.Исходящее;
		Запись.ЧатID               = Ответ.chat_hostname;
		Запись.ТокенСообщния       = СтрЗаменить(Ответ.message_token, Символ(160), "");
		Запись.ИсточникПривличения = Настройка;
		Если СтруктураФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Видео Тогда
			Запись.Видео = Истина;
		ИначеЕсли СтруктураФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Изображение Тогда
			Запись.Картинка = истина;
		Иначе			
			Запись.Файл                = Истина;
		КонецЕсли;
		
		Запись.Текст               = Текст;
		Запись.ПутьКФайлу          = СтруктураФайла.Путь;
		Запись.Размер              = СтруктураФайла.Размер;
		Запись.Наименование        = СтруктураФайла.Имя; 
		Запись.ФайлВБазе           = СтруктураФайла.ФайлТам;
		Запись.Менеджер            = Справочники.Пользователи.НайтиПоНаименованию(Пользователь.Имя).ТорговыйАгент;
		Запись.Записать();
	Иначе
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		Запись.Дата                = ТекущаяДатаСеанса();
		Запись.Контакт             = Контакт;
		Запись.Напрвление          = Перечисления.Viber_Направление.Исходящее;
		Запись.ЧатID               = Ответ.chat_hostname;
		Запись.ТокенСообщния       = СтрЗаменить(Ответ.message_token, Символ(160), "");
		Запись.ИсточникПривличения = Настройка;
		Запись.Текст               = Текст;
		Запись.Менеджер            = Справочники.Пользователи.НайтиПоНаименованию(Пользователь.Имя).ТорговыйАгент;
		Запись.Записать();
	КонецЕсли; 	
	
	
КонецПроцедуры

////// клиент существует /////////////////////////
Функция КлиентСуществует(ИД);
	
	Контакт = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактыViber.Ссылка
		|ИЗ
		|	Справочник.КонтактыViber КАК КонтактыViber
		|ГДЕ
		|	КонтактыViber.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", СокрЛ(ИД));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Контакт= Истина;	
	КонецЦикла;
	
	Возврат Контакт;
	
КонецФункции


#КонецОбласти
